qkhhyu/esp32-s3-storybook-console/components/brookesia_app_gravity_blocks/esp_brookesia_app_gravity_blocks.cpp
/*
 * SPDX-FileCopyrightText: 2026
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <algorithm>
#include <cmath>
#include <cstdio>
#include <cstdlib>
#include <ctime>
#include <vector>
extern "C" {
#include "qmi8658.h"
}
#include "bsp/display.h"
#include "bsp/esp32_s3_touch_amoled_2_06.h"
#include "esp_brookesia.hpp"
#include "esp_log.h"
#include "storybook_ui_helpers.hpp"
#ifdef ESP_UTILS_LOG_TAG
#   undef ESP_UTILS_LOG_TAG
#endif
#define ESP_UTILS_LOG_TAG "AppGravity"
#include "esp_lib_utils.h"

using namespace esp_brookesia::systems;
using namespace esp_brookesia::gui;

namespace {

constexpr const char *TAG = "GravityBlocks";
constexpr const char *APP_NAME = "Gravity";
constexpr uint32_t APP_ICON_COLOR = 0x56C0FF;
constexpr int MAX_BLOCKS = 15;
constexpr int MIN_BLOCK_RADIUS = 14;
constexpr int MAX_BLOCK_RADIUS = 28;
constexpr int TIMER_INTERVAL_MS = 20;
constexpr int CALIBRATION_SAMPLES = 72;
constexpr int HUD_RESERVED_HEIGHT = 126;
constexpr float ACCEL_SCALE_FACTOR = 4.5F;
constexpr float ACCEL_FILTER_ALPHA = 0.22F;
constexpr float CALIBRATION_DEADZONE = 0.05F;
constexpr float CALIBRATION_STABLE_RANGE = 0.18F;
constexpr float SCREEN_WIDTH_MM = 33.09F;
constexpr float SCREEN_HEIGHT_MM = 41.51F;
constexpr float CORNER_RADIUS_MM = 9.2F;

struct Block {
    lv_obj_t *obj = nullptr;
    int radius = 0;
    int x_pos = 0;
    int y_pos = 0;
};

enum class BlockStyle : uint8_t {
    Round = 0,
    SoftSquare,
    SharpSquare,
    Capsule,
};

constexpr base::App::Config make_core_config()
{
    auto config = base::App::Config::SIMPLE_CONSTRUCTOR(APP_NAME, nullptr, true);
    config.launcher_icon = StyleImage::IMAGE_RECOLOR(&esp_brookesia_image_small_app_launcher_default_98_98, APP_ICON_COLOR);
    return config;
}

phone::App::Config make_phone_config()
{
    storybook::ui::PhoneAppChromeOptions options = {};
    options.show_status_bar = false;
    options.show_navigation_bar = false;
    options.launcher_page_index = 0;
    return storybook::ui::makePhoneAppConfig(options);
}

int clamp_int(int value, int min_value, int max_value)
{
    return std::clamp(value, min_value, max_value);
}

lv_color_t random_block_color()
{
    return lv_color_hsv_to_rgb(std::rand() % 360, 60 + (std::rand() % 25), 88 + (std::rand() % 10));
}

bool blocks_overlap(const Block &lhs, const Block &rhs)
{
    int dx = lhs.x_pos - rhs.x_pos;
    int dy = lhs.y_pos - rhs.y_pos;
    int min_distance = lhs.radius + rhs.radius;
    return ((dx * dx) + (dy * dy)) < (min_distance * min_distance);
}

bool blocks_overlap_at(const Block &lhs, const Block &rhs, int lhs_x, int lhs_y)
{
    int dx = lhs_x - rhs.x_pos;
    int dy = lhs_y - rhs.y_pos;
    int min_distance = lhs.radius + rhs.radius;
    return ((dx * dx) + (dy * dy)) < (min_distance * min_distance);
}

void constrain_to_rounded_rect(int &x, int &y, int width, int height, int top_inset, int shape_radius)
{
    float px_per_mm_x = static_cast<float>(width) / SCREEN_WIDTH_MM;
    float px_per_mm_y = static_cast<float>(height) / SCREEN_HEIGHT_MM;
    float px_per_mm = std::min(px_per_mm_x, px_per_mm_y);

    int corner_radius_px = static_cast<int>(CORNER_RADIUS_MM * px_per_mm);
    corner_radius_px = std::max(corner_radius_px, shape_radius + 6);

    int min_y = top_inset + shape_radius;
    int safe_left = corner_radius_px;
    int safe_right = width - corner_radius_px;
    int safe_top = std::max(corner_radius_px, top_inset + corner_radius_px);
    int safe_bottom = height - corner_radius_px;
    int corner_radius_effective = corner_radius_px - shape_radius;

    x = clamp_int(x, shape_radius, width - shape_radius);
    y = clamp_int(y, min_y, height - shape_radius);

    auto pull_to_corner_arc = [&](int center_x, int center_y, int sign_x, int sign_y) {
        float dx = static_cast<float>(sign_x * (center_x - x));
        float dy = static_cast<float>(sign_y * (center_y - y));
        float dist = std::sqrt((dx * dx) + (dy * dy));
        if ((dist > 0.0F) && (dist > corner_radius_effective)) {
            float ratio = static_cast<float>(corner_radius_effective) / dist;
            x = center_x - static_cast<int>((dx * ratio) * sign_x);
            y = center_y - static_cast<int>((dy * ratio) * sign_y);
        }
    };

    if ((x < safe_left) && (y < safe_top)) {
        pull_to_corner_arc(safe_left, safe_top, 1, 1);
    } else if ((x > safe_right) && (y < safe_top)) {
        pull_to_corner_arc(safe_right, safe_top, -1, 1);
    } else if ((x < safe_left) && (y > safe_bottom)) {
        pull_to_corner_arc(safe_left, safe_bottom, 1, -1);
    } else if ((x > safe_right) && (y > safe_bottom)) {
        pull_to_corner_arc(safe_right, safe_bottom, -1, -1);
    }

    y = std::max(y, min_y);
}

lv_obj_t *create_block(lv_obj_t *parent, BlockStyle style, int radius, lv_color_t color)
{
    lv_obj_t *obj = lv_obj_create(parent);
    lv_obj_remove_style_all(obj);
    lv_obj_set_size(obj, radius * 2, radius * 2);
    lv_obj_set_style_bg_opa(obj, LV_OPA_COVER, 0);
    lv_obj_set_style_bg_color(obj, color, 0);
    lv_obj_set_style_border_width(obj, 0, 0);
    lv_obj_set_style_shadow_width(obj, 18, 0);
    lv_obj_set_style_shadow_color(obj, lv_color_black(), 0);
    lv_obj_set_style_shadow_opa(obj, LV_OPA_30, 0);
    lv_obj_set_style_shadow_offset_y(obj, 6, 0);

    switch (style) {
    case BlockStyle::Round:
        lv_obj_set_style_radius(obj, LV_RADIUS_CIRCLE, 0);
        break;
    case BlockStyle::SoftSquare:
        lv_obj_set_style_radius(obj, 18, 0);
        break;
    case BlockStyle::SharpSquare:
        lv_obj_set_style_radius(obj, 4, 0);
        break;
    case BlockStyle::Capsule:
    default:
        lv_obj_set_size(obj, radius * 2, static_cast<int>(radius * 1.5F));
        lv_obj_set_style_radius(obj, LV_RADIUS_CIRCLE, 0);
        break;
    }

    return obj;
}

lv_obj_t *create_hud_button(lv_obj_t *parent, const char *text, lv_color_t color_from, lv_color_t color_to,
                            lv_event_cb_t event_cb, void *user_data, lv_obj_t **label_output = nullptr)
{
    lv_obj_t *button = lv_button_create(parent);
    lv_obj_set_style_bg_color(button, color_from, 0);
    lv_obj_set_style_bg_grad_color(button, color_to, 0);
    lv_obj_set_style_bg_grad_dir(button, LV_GRAD_DIR_HOR, 0);
    lv_obj_set_style_border_width(button, 0, 0);
    lv_obj_set_style_radius(button, 18, 0);
    lv_obj_add_event_cb(button, event_cb, LV_EVENT_CLICKED, user_data);

