qkhhyu/esp32-s3-storybook-console/components/brookesia_app_gravity_blocks/esp_brookesia_app_gravity_blocks.cpp
    lv_obj_t *label = lv_label_create(button);
    lv_label_set_text(label, text);
    lv_obj_set_style_text_color(label, lv_color_hex(0x092033), 0);
    lv_obj_center(label);

    if (label_output != nullptr) {
        *label_output = label;
    }
    return button;
}

} // namespace

namespace esp_brookesia::apps {

class GravityBlocksApp final : public systems::phone::App {
public:
    static GravityBlocksApp *requestInstance()
    {
        static GravityBlocksApp instance;
        return &instance;
    }

    GravityBlocksApp(): App(make_core_config(), make_phone_config())
    {
    }

    bool run() override
    {
        if (!_rng_seeded) {
            std::srand(static_cast<unsigned>(std::time(nullptr)));
            _rng_seeded = true;
        }

        lv_obj_t *screen = lv_screen_active();
        lv_obj_set_style_bg_color(screen, lv_color_hex(0x08131F), 0);
        lv_obj_set_style_bg_grad_color(screen, lv_color_hex(0x12324B), 0);
        lv_obj_set_style_bg_grad_dir(screen, LV_GRAD_DIR_VER, 0);

        _display_width = BSP_LCD_H_RES;
        _display_height = BSP_LCD_V_RES;

        _root = lv_obj_create(screen);
        lv_obj_remove_style_all(_root);
        lv_obj_set_size(_root, lv_pct(100), lv_pct(100));
        lv_obj_clear_flag(_root, LV_OBJ_FLAG_SCROLLABLE);
        lv_obj_set_style_bg_opa(_root, LV_OPA_TRANSP, 0);

        _scene = lv_obj_create(_root);
        lv_obj_remove_style_all(_scene);
        lv_obj_set_size(_scene, lv_pct(100), lv_pct(100));
        lv_obj_set_style_bg_opa(_scene, LV_OPA_TRANSP, 0);
        lv_obj_clear_flag(_scene, LV_OBJ_FLAG_SCROLLABLE);

        buildHud();
        generateBlocks();

        if (ensureImuReady() == ESP_OK) {
            startCalibration("Hold level for calibration");
        } else {
            setStatusText("QMI8658 init failed");
        }

        refreshInfoText();
        _physics_timer = lv_timer_create(&GravityBlocksApp::onPhysicsTimer, TIMER_INTERVAL_MS, this);
        return true;
    }

    bool back() override
    {
        return notifyCoreClosed();
    }

    bool close() override
    {
        if (_physics_timer != nullptr) {
            lv_timer_delete(_physics_timer);
            _physics_timer = nullptr;
        }

        clearBlocks();
        _root = nullptr;
        _scene = nullptr;
        _hud = nullptr;
        _status_label = nullptr;
        _tilt_label = nullptr;
        _meta_label = nullptr;
        _recalibrate_button = nullptr;
        _pause_button = nullptr;
        _pause_button_label = nullptr;
        _reset_button = nullptr;
        _calibrating = false;
        _recalibration_requested = false;
        _reset_requested = false;
        _paused = false;
        _calibration_sample_count = 0;
        _filtered_accel_x = 0.0F;
        _filtered_accel_y = 0.0F;
        return true;
    }

private:
    void buildHud()
    {
        _hud = lv_obj_create(_root);
        lv_obj_remove_style_all(_hud);
        lv_obj_set_size(_hud, lv_pct(100), LV_SIZE_CONTENT);
        lv_obj_align(_hud, LV_ALIGN_TOP_MID, 0, 10);
        lv_obj_set_style_pad_hor(_hud, 14, 0);
        lv_obj_set_layout(_hud, LV_LAYOUT_FLEX);
        lv_obj_set_flex_flow(_hud, LV_FLEX_FLOW_COLUMN);
        lv_obj_set_style_pad_row(_hud, 8, 0);
        lv_obj_clear_flag(_hud, LV_OBJ_FLAG_SCROLLABLE);

        lv_obj_t *panel = lv_obj_create(_hud);
        lv_obj_set_width(panel, lv_pct(100));
        lv_obj_set_height(panel, LV_SIZE_CONTENT);
        lv_obj_set_style_radius(panel, 24, 0);
        lv_obj_set_style_bg_color(panel, lv_color_hex(0x13314A), 0);
        lv_obj_set_style_bg_opa(panel, LV_OPA_70, 0);
        lv_obj_set_style_border_width(panel, 1, 0);
        lv_obj_set_style_border_color(panel, lv_color_hex(0x5EA7DB), 0);
        lv_obj_set_style_shadow_width(panel, 22, 0);
        lv_obj_set_style_shadow_color(panel, lv_color_hex(0x050A12), 0);
        lv_obj_set_style_shadow_opa(panel, LV_OPA_40, 0);
        lv_obj_set_style_pad_all(panel, 14, 0);
        lv_obj_set_layout(panel, LV_LAYOUT_FLEX);
        lv_obj_set_flex_flow(panel, LV_FLEX_FLOW_ROW_WRAP);
        lv_obj_set_style_pad_row(panel, 8, 0);
        lv_obj_set_style_pad_column(panel, 10, 0);

        lv_obj_t *title = lv_label_create(panel);
        lv_label_set_text(title, "Gravity Blocks");
        lv_obj_set_style_text_font(title, &lv_font_montserrat_24, 0);
        lv_obj_set_style_text_color(title, lv_color_hex(0xF2FAFF), 0);
        lv_obj_set_flex_grow(title, 1);

        _pause_button = create_hud_button(
            panel, "Pause", lv_color_hex(0xFFD166), lv_color_hex(0xFF9F1C), &GravityBlocksApp::onPauseClicked, this,
            &_pause_button_label
        );
        _reset_button = create_hud_button(
            panel, "Reset", lv_color_hex(0xF78C6B), lv_color_hex(0xFF5D73), &GravityBlocksApp::onResetClicked, this
        );
        _recalibrate_button = create_hud_button(
            panel, "Recalibrate", lv_color_hex(0x5BC0FF), lv_color_hex(0x9BE15D), &GravityBlocksApp::onRecalibrateClicked,
            this
        );

        _status_label = lv_label_create(panel);
        lv_obj_set_width(_status_label, lv_pct(100));
        lv_label_set_long_mode(_status_label, LV_LABEL_LONG_WRAP);
        lv_obj_set_style_text_font(_status_label, &lv_font_montserrat_16, 0);
        lv_obj_set_style_text_color(_status_label, lv_color_hex(0xB7D8EB), 0);

        _tilt_label = lv_label_create(panel);
        lv_obj_set_width(_tilt_label, lv_pct(100));
        lv_obj_set_style_text_font(_tilt_label, &lv_font_montserrat_14, 0);
        lv_obj_set_style_text_color(_tilt_label, lv_color_hex(0x7EB6D8), 0);

        _meta_label = lv_label_create(panel);
        lv_obj_set_width(_meta_label, lv_pct(100));
        lv_obj_set_style_text_font(_meta_label, &lv_font_montserrat_14, 0);
        lv_obj_set_style_text_color(_meta_label, lv_color_hex(0x81C3E7), 0);
    }

    void clearBlocks()
    {
        for (auto &block : _blocks) {
            if (block.obj != nullptr) {
                lv_obj_delete(block.obj);
                block.obj = nullptr;
            }
        }
        _blocks.clear();
    }

    void setStatusText(const char *text)
    {
        if (_status_label != nullptr) {
            lv_label_set_text(_status_label, text);
        }
    }

