qkhhyu/esp32-s3-storybook-console/components/brookesia_app_gravity_blocks/esp_brookesia_app_gravity_blocks.cpp
    void refreshInfoText()
    {
        if (_pause_button_label != nullptr) {
            lv_label_set_text(_pause_button_label, _paused ? "Resume" : "Pause");
        }
        if (_meta_label != nullptr) {
            char buffer[72] = {0};
            std::snprintf(
                buffer, sizeof(buffer), "%u blocks | %s", static_cast<unsigned>(_blocks.size()),
                _paused ? "Paused" : (_calibrating ? "Calibrating" : "Live")
            );
            lv_label_set_text(_meta_label, buffer);
        }
        if (_tilt_label != nullptr) {
            if (_calibrating) {
                lv_label_set_text(_tilt_label, "Keep device flat and still");
            } else if (_paused) {
                lv_label_set_text(_tilt_label, "Motion updates are paused");
            }
        }
    }

    esp_err_t ensureImuReady()
    {
        if (_imu_ready) {
            return ESP_OK;
        }

        i2c_master_bus_handle_t bus_handle = bsp_i2c_get_handle();
        if (bus_handle == nullptr) {
            ESP_LOGE(TAG, "Get I2C bus failed");
            return ESP_FAIL;
        }

        esp_err_t ret = qmi8658_init(&_imu, bus_handle, QMI8658_ADDRESS_HIGH);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Init QMI8658 failed: %s", esp_err_to_name(ret));
            return ret;
        }

        ESP_ERROR_CHECK_WITHOUT_ABORT(qmi8658_set_accel_range(&_imu, QMI8658_ACCEL_RANGE_8G));
        ESP_ERROR_CHECK_WITHOUT_ABORT(qmi8658_set_accel_odr(&_imu, QMI8658_ACCEL_ODR_500HZ));
        qmi8658_set_accel_unit_mps2(&_imu, true);
        ESP_ERROR_CHECK_WITHOUT_ABORT(qmi8658_write_register(&_imu, QMI8658_CTRL5, 0x03));

        _imu_ready = true;
        ESP_LOGI(TAG, "QMI8658 ready for gravity blocks app");
        return ESP_OK;
    }

    void startCalibration(const char *reason)
    {
        _calibrating = true;
        _recalibration_requested = false;
        _calibration_sample_count = 0;
        _calibration_sum_x = 0.0F;
        _calibration_sum_y = 0.0F;
        _calibration_max_x = -100.0F;
        _calibration_min_x = 100.0F;
        _calibration_max_y = -100.0F;
        _calibration_min_y = 100.0F;
        _filtered_accel_x = 0.0F;
        _filtered_accel_y = 0.0F;
        setStatusText(reason);
        refreshInfoText();
    }

    void updateCalibration(const qmi8658_data_t &data)
    {
        _calibration_sum_x += data.accelX;
        _calibration_sum_y += data.accelY;
        _calibration_max_x = std::max(_calibration_max_x, data.accelX);
        _calibration_min_x = std::min(_calibration_min_x, data.accelX);
        _calibration_max_y = std::max(_calibration_max_y, data.accelY);
        _calibration_min_y = std::min(_calibration_min_y, data.accelY);
        _calibration_sample_count++;

        if (_calibration_sample_count < CALIBRATION_SAMPLES) {
            char buffer[72] = {0};
            int percent = (_calibration_sample_count * 100) / CALIBRATION_SAMPLES;
            std::snprintf(buffer, sizeof(buffer), "Calibrating level... %d%%", percent);
            setStatusText(buffer);
            refreshInfoText();
            return;
        }

        float range_x = _calibration_max_x - _calibration_min_x;
        float range_y = _calibration_max_y - _calibration_min_y;
        if ((range_x > CALIBRATION_STABLE_RANGE) || (range_y > CALIBRATION_STABLE_RANGE)) {
            startCalibration("Keep device still and try again");
            return;
        }

        _accel_bias_x = _calibration_sum_x / static_cast<float>(CALIBRATION_SAMPLES);
        _accel_bias_y = _calibration_sum_y / static_cast<float>(CALIBRATION_SAMPLES);
        _calibrating = false;
        setStatusText(_paused ? "Calibrated. Press Resume to continue" : "Tilt device to move the blocks");
        refreshInfoText();
        ESP_LOGI(TAG, "Calibration done: bias_x=%.4f bias_y=%.4f", static_cast<double>(_accel_bias_x), static_cast<double>(_accel_bias_y));
    }

    void applyCalibration(qmi8658_data_t &data) const
    {
        data.accelX -= _accel_bias_x;
        data.accelY -= _accel_bias_y;
        if (std::fabs(data.accelX) < CALIBRATION_DEADZONE) {
            data.accelX = 0.0F;
        }
        if (std::fabs(data.accelY) < CALIBRATION_DEADZONE) {
            data.accelY = 0.0F;
        }
    }

    void generateBlocks()
    {
        clearBlocks();
        for (int i = 0; i < MAX_BLOCKS; ++i) {
            Block block;
            block.radius = MIN_BLOCK_RADIUS + (std::rand() % ((MAX_BLOCK_RADIUS - MIN_BLOCK_RADIUS) + 1));
            BlockStyle style = static_cast<BlockStyle>(std::rand() % 4);
            lv_color_t color = random_block_color();
            block.obj = create_block(_scene, style, block.radius, color);
            if (block.obj == nullptr) {
                continue;
            }

            bool valid_position = false;
            for (int attempt = 0; attempt < 140; ++attempt) {
                block.x_pos = block.radius + (std::rand() % std::max(1, _display_width - (block.radius * 2)));
                block.y_pos = HUD_RESERVED_HEIGHT + block.radius +
                              (std::rand() % std::max(1, (_display_height - HUD_RESERVED_HEIGHT) - (block.radius * 2)));

                valid_position = true;
                for (const auto &existing : _blocks) {
                    if (blocks_overlap(block, existing)) {
                        valid_position = false;
                        break;
                    }
                }
                if (valid_position) {
                    break;
                }
            }

            if (!valid_position) {
                lv_obj_delete(block.obj);
                continue;
            }

            lv_obj_set_pos(block.obj, block.x_pos - block.radius, block.y_pos - block.radius);
            _blocks.push_back(block);
        }
        refreshInfoText();
    }

    void resolveCollisions(size_t active_index)
    {
        for (size_t i = 0; i < _blocks.size(); ++i) {
            if (i == active_index) {
                continue;
            }

            if (!blocks_overlap(_blocks[active_index], _blocks[i])) {
                continue;
            }

            int dx = _blocks[active_index].x_pos - _blocks[i].x_pos;
            int dy = _blocks[active_index].y_pos - _blocks[i].y_pos;
            float distance = std::sqrt(static_cast<float>((dx * dx) + (dy * dy)));
            float overlap = static_cast<float>(_blocks[active_index].radius + _blocks[i].radius) - distance;

            if (distance > 0.0F) {
                float ratio = overlap / (2.0F * distance);
                _blocks[active_index].x_pos += static_cast<int>(dx * ratio);
                _blocks[active_index].y_pos += static_cast<int>(dy * ratio);
                _blocks[i].x_pos -= static_cast<int>(dx * ratio);
                _blocks[i].y_pos -= static_cast<int>(dy * ratio);
            } else {
                _blocks[active_index].x_pos += (std::rand() % 7) - 3;
                _blocks[active_index].y_pos += (std::rand() % 7) - 3;
            }

            constrain_to_rounded_rect(_blocks[i].x_pos, _blocks[i].y_pos, _display_width, _display_height, HUD_RESERVED_HEIGHT,
                                      _blocks[i].radius);
            lv_obj_set_pos(_blocks[i].obj, _blocks[i].x_pos - _blocks[i].radius, _blocks[i].y_pos - _blocks[i].radius);
        }
    }

