qkhhyu/esp32-s3-storybook-console/components/brookesia_app_gravity_blocks/esp_brookesia_app_gravity_blocks.cpp
    void updateBlocks(qmi8658_data_t &data)
    {
        applyCalibration(data);
        _filtered_accel_x = (_filtered_accel_x * (1.0F - ACCEL_FILTER_ALPHA)) + (data.accelX * ACCEL_FILTER_ALPHA);
        _filtered_accel_y = (_filtered_accel_y * (1.0F - ACCEL_FILTER_ALPHA)) + (data.accelY * ACCEL_FILTER_ALPHA);

        int move_x = clamp_int(-static_cast<int>(_filtered_accel_y * ACCEL_SCALE_FACTOR), -10, 10);
        int move_y = clamp_int(static_cast<int>(_filtered_accel_x * ACCEL_SCALE_FACTOR), -10, 10);

        char tilt_buffer[72] = {0};
        std::snprintf(tilt_buffer, sizeof(tilt_buffer), "Tilt X %.2f  Y %.2f", static_cast<double>(_filtered_accel_x), static_cast<double>(_filtered_accel_y));
        if (_tilt_label != nullptr) {
            lv_label_set_text(_tilt_label, tilt_buffer);
        }

        for (size_t i = 0; i < _blocks.size(); ++i) {
            int next_x = _blocks[i].x_pos + move_x;
            int next_y = _blocks[i].y_pos + move_y;
            bool collision = false;

            for (size_t j = 0; j < _blocks.size(); ++j) {
                if (i == j) {
                    continue;
                }
                if (blocks_overlap_at(_blocks[i], _blocks[j], next_x, next_y)) {
                    collision = true;
                    break;
                }
            }

            if (!collision) {
                _blocks[i].x_pos = next_x;
                _blocks[i].y_pos = next_y;
            }

            constrain_to_rounded_rect(_blocks[i].x_pos, _blocks[i].y_pos, _display_width, _display_height, HUD_RESERVED_HEIGHT,
                                      _blocks[i].radius);
            resolveCollisions(i);
            constrain_to_rounded_rect(_blocks[i].x_pos, _blocks[i].y_pos, _display_width, _display_height, HUD_RESERVED_HEIGHT,
                                      _blocks[i].radius);
            lv_obj_set_pos(_blocks[i].obj, _blocks[i].x_pos - _blocks[i].radius, _blocks[i].y_pos - _blocks[i].radius);
        }
    }

    static GravityBlocksApp *fromEvent(lv_event_t *event)
    {
        return static_cast<GravityBlocksApp *>(lv_event_get_user_data(event));
    }

    static void onPauseClicked(lv_event_t *event)
    {
        auto *self = fromEvent(event);
        if (self == nullptr) {
            return;
        }

        self->_paused = !self->_paused;
        if (!self->_calibrating) {
            self->setStatusText(self->_paused ? "Physics paused" : "Tilt device to move the blocks");
        }
        self->refreshInfoText();
    }

    static void onResetClicked(lv_event_t *event)
    {
        auto *self = fromEvent(event);
        if (self != nullptr) {
            self->_reset_requested = true;
        }
    }

    static void onRecalibrateClicked(lv_event_t *event)
    {
        auto *self = fromEvent(event);
        if (self != nullptr) {
            self->_recalibration_requested = true;
        }
    }

    static void onPhysicsTimer(lv_timer_t *timer)
    {
        auto *self = static_cast<GravityBlocksApp *>(timer->user_data);
        if ((self == nullptr) || !self->_imu_ready) {
            return;
        }

        if (self->_reset_requested) {
            self->_reset_requested = false;
            self->generateBlocks();
            self->setStatusText(self->_paused ? "Blocks reset while paused" : "Blocks reset");
            self->refreshInfoText();
        }

        if (self->_recalibration_requested && !self->_calibrating) {
            self->startCalibration("Recalibrating...");
        }

        bool ready = false;
        if (qmi8658_is_data_ready(&self->_imu, &ready) != ESP_OK) {
            return;
        }
        if (!ready) {
            return;
        }

        qmi8658_data_t data = {};
        if (qmi8658_read_sensor_data(&self->_imu, &data) != ESP_OK) {
            return;
        }

        if (self->_calibrating) {
            self->updateCalibration(data);
        } else if (!self->_paused) {
            self->updateBlocks(data);
        }
    }

    lv_obj_t *_root = nullptr;
    lv_obj_t *_scene = nullptr;
    lv_obj_t *_hud = nullptr;
    lv_obj_t *_status_label = nullptr;
    lv_obj_t *_tilt_label = nullptr;
    lv_obj_t *_meta_label = nullptr;
    lv_obj_t *_recalibrate_button = nullptr;
    lv_obj_t *_pause_button = nullptr;
    lv_obj_t *_pause_button_label = nullptr;
    lv_obj_t *_reset_button = nullptr;
    lv_timer_t *_physics_timer = nullptr;
    std::vector<Block> _blocks;
    qmi8658_dev_t _imu = {};
    bool _imu_ready = false;
    bool _calibrating = false;
    bool _recalibration_requested = false;
    bool _reset_requested = false;
    bool _paused = false;
    bool _rng_seeded = false;
    int _display_width = 0;
    int _display_height = 0;
    int _calibration_sample_count = 0;
    float _accel_bias_x = 0.0F;
    float _accel_bias_y = 0.0F;
    float _filtered_accel_x = 0.0F;
    float _filtered_accel_y = 0.0F;
    float _calibration_sum_x = 0.0F;
    float _calibration_sum_y = 0.0F;
    float _calibration_max_x = -100.0F;
    float _calibration_min_x = 100.0F;
    float _calibration_max_y = -100.0F;
    float _calibration_min_y = 100.0F;
};

ESP_UTILS_REGISTER_PLUGIN_WITH_CONSTRUCTOR(systems::base::App, GravityBlocksApp, APP_NAME, []() {
    return std::shared_ptr<GravityBlocksApp>(GravityBlocksApp::requestInstance(), [](GravityBlocksApp *app) {
        (void)app;
    });
})

} // namespace esp_brookesia::apps


